CREATE DATABASE  IF NOT EXISTS `eventband` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `eventband`;
-- MySQL dump 10.13  Distrib 8.0.33, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: eventband
-- ------------------------------------------------------
-- Server version	8.0.33

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `chatrecord`
--

DROP TABLE IF EXISTS `chatrecord`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `chatrecord` (
  `chr_id` int NOT NULL AUTO_INCREMENT,
  `chr_event_id` int DEFAULT '-1',
  `chr_sender_id` int NOT NULL,
  `chr_recv_id` int DEFAULT '-1',
  `chr_content` varchar(500) NOT NULL,
  `chr_type` int NOT NULL DEFAULT '0',
  `chr_time` datetime NOT NULL,
  PRIMARY KEY (`chr_id`)
) ENGINE=InnoDB AUTO_INCREMENT=93 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `chatrecord`
--

LOCK TABLES `chatrecord` WRITE;
/*!40000 ALTER TABLE `chatrecord` DISABLE KEYS */;
INSERT INTO `chatrecord` VALUES (8,18,25,-1,'大家好，这里就是我们的群了',0,'2024-06-11 10:26:00'),(9,18,7,-1,'好耶',0,'2024-06-11 10:27:00'),(10,18,9,-1,'大家好',0,'2024-06-11 10:27:30'),(11,18,25,-1,'大家准备活动买东西可以找我报销',0,'2024-06-11 10:29:00'),(12,18,12,-1,'我要报销我要报销',0,'2024-06-11 10:30:40'),(13,18,11,-1,'有谁知道地点在哪里吗[呆]',0,'2024-06-14 09:10:00'),(14,-1,25,12,'sxy干嘛呢',1,'2024-06-14 09:10:00'),(15,-1,12,25,'别问，问就是睡觉',1,'2024-06-14 09:10:40'),(16,20,25,-1,'老师好，我加入进来就算报名成功了吗？',0,'2024-06-14 09:13:00'),(17,20,36,-1,'对的',0,'2024-06-14 09:14:00'),(18,20,26,-1,'你能在这里聊天说明你已经加入活动了',0,'2024-06-14 09:15:00'),(19,20,25,-1,'谢谢你们呜呜呜呜，你们真好',0,'2024-06-14 09:20:00'),(25,20,25,-1,'aaaa',0,'2024-06-14 10:20:32'),(26,20,36,-1,'aaa',0,'2024-06-14 12:50:53'),(27,20,36,-1,'发送消息',0,'2024-06-14 12:51:04'),(28,18,25,-1,'大家好',0,'2024-06-14 12:53:51'),(29,20,25,-1,'发送消息',0,'2024-06-14 13:01:44'),(30,20,25,-1,'测试消息1111',0,'2024-06-14 13:02:20'),(31,20,36,-1,'12345',0,'2024-06-14 13:02:51'),(32,20,36,-1,'aaaa',0,'2024-06-14 13:03:31'),(33,20,25,-1,'aaaaaaaa',0,'2024-06-14 13:03:37'),(34,20,36,-1,'aaa',0,'2024-06-14 13:04:26'),(35,20,36,-1,'aaaaa',0,'2024-06-14 13:05:09'),(36,20,36,-1,'ceshifasong1111',0,'2024-06-14 13:07:07'),(37,20,25,-1,'aaaa',0,'2024-06-14 13:09:50'),(38,20,36,-1,'aaaa',0,'2024-06-14 13:10:12'),(39,20,36,-1,'aaaaa',0,'2024-06-14 13:10:20'),(40,20,36,-1,'aaa',0,'2024-06-14 13:12:31'),(41,20,36,-1,'aaaaa',0,'2024-06-14 13:12:59'),(42,20,36,-1,'最新测试消息',0,'2024-06-14 13:13:20'),(43,20,25,-1,'测试11',0,'2024-06-14 13:14:12'),(44,20,37,-1,'abc',0,'2024-06-14 13:16:05'),(45,20,25,-1,'大家好',0,'2024-06-14 13:16:08'),(46,20,37,-1,'abcd',0,'2024-06-14 13:16:27'),(47,20,37,-1,'sxy',0,'2024-06-14 13:17:24'),(48,20,37,-1,'s',0,'2024-06-14 13:17:32'),(49,20,25,-1,'aaa',0,'2024-06-14 13:17:43'),(50,20,37,-1,'a',0,'2024-06-14 13:17:51'),(57,20,37,-1,'hh',0,'2024-06-14 13:26:12'),(58,20,37,-1,'dd\n',0,'2024-06-14 13:27:34'),(59,20,37,-1,'dddd',0,'2024-06-14 13:29:33'),(60,20,37,-1,'asdf',0,'2024-06-14 13:32:25'),(61,20,37,-1,'fff',0,'2024-06-14 13:32:59'),(62,20,36,-1,'aaa',0,'2024-06-14 13:34:44'),(63,20,36,-1,'aaa',0,'2024-06-14 13:37:42'),(64,20,36,-1,'aaa',0,'2024-06-14 13:37:50'),(65,20,36,-1,'aaa',0,'2024-06-14 13:40:47'),(66,20,37,-1,'adadadada',0,'2024-06-14 13:40:54'),(67,20,37,-1,'df',0,'2024-06-14 13:42:30'),(68,20,37,-1,'dfdfdfd',0,'2024-06-14 13:44:33'),(69,20,37,-1,'hhh',0,'2024-06-14 13:45:17'),(70,20,37,-1,'hhjhj',0,'2024-06-14 13:46:13'),(71,20,37,-1,'111',0,'2024-06-14 13:46:29'),(72,20,37,-1,'11',0,'2024-06-14 13:46:47'),(73,20,37,-1,'1111',0,'2024-06-14 13:47:07'),(74,20,37,-1,'kkk',0,'2024-06-14 13:47:41'),(75,20,37,-1,'wq',0,'2024-06-14 13:48:22'),(76,20,37,-1,'dsqdqd',0,'2024-06-14 13:48:50'),(77,20,37,-1,'dsad',0,'2024-06-14 13:49:16'),(78,20,37,-1,'fs',0,'2024-06-14 13:49:36'),(79,20,37,-1,'s',0,'2024-06-14 13:49:57'),(80,20,37,-1,'jj',0,'2024-06-14 13:50:03'),(81,20,37,-1,'jjjjjkkk',0,'2024-06-14 13:50:13'),(82,20,37,-1,'ffaf',0,'2024-06-14 13:50:40'),(83,20,37,-1,'kkkk',0,'2024-06-14 13:50:47'),(84,20,37,-1,'tytytyt',0,'2024-06-14 13:51:07'),(85,20,37,-1,'axxxxaxa',0,'2024-06-14 13:51:35'),(86,20,37,-1,'dddd',0,'2024-06-14 13:53:02'),(87,20,36,-1,'aaa',0,'2024-06-14 13:53:44'),(88,20,36,-1,'aaa',0,'2024-06-14 13:53:47'),(89,20,25,-1,'aaa',0,'2024-06-14 13:53:59'),(90,20,36,-1,'aaa',0,'2024-06-14 13:54:01'),(91,20,36,-1,'aaa',0,'2024-06-14 13:54:17'),(92,20,25,-1,'大家好',0,'2024-06-14 14:10:24');
/*!40000 ALTER TABLE `chatrecord` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-06-22 23:49:33
